TheMasterCoder007/embedded-react/backends/esp32-lcd/renderer_backend.c
/*
 * Copyright 2026 Cory Lamming
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/*
 * ESP32 LCD render backend — board-agnostic software framebuffer + RGB565 flush.
 *
 * The engine always hands this backend ARGB8888 sources (straight-alpha fills, premultiplied
 * copy/blend). The backend keeps a persistent "canonical" framebuffer in PSRAM that those
 * fill/copy/blend composite into (premultiplied over an opaque background), tracks the dirty
 * bounding box, and on present pushes just that region to the esp_lcd panel (which is always
 * RGB565).
 *
 * PIXEL FORMAT OF THE CANONICAL FRAMEBUFFER is selectable via ER_LCD_FB_RGB565 (default 1):
 *   - 1 (RGB565): the canonical fb is itself RGB565. Compositing unpacks the dst to 8-bit, blends
 *     in full precision, and packs back to 565. Present is then a plain 565→565 copy of the dirty
 *     region into the panel framebuffer — the per-frame ARGB→RGB565 CONVERSION PASS IS GONE, the
 *     canonical fb is half the size (2 B/px), and per-pixel compositing bandwidth roughly halves.
 *     This is the device default (the panel is physically 565, so this only moves the 565 rounding
 *     a step earlier; quality is effectively unchanged for flat UI).
 *   - 0 (ARGB8888): the canonical fb is ARGB8888 and present converts the dirty region to RGB565.
 *     Full-precision intermediate (no per-blend banding); useful as an A/B reference or on hosts
 *     that are not PSRAM-bandwidth-bound.
 *
 * DIRECT MODE (ER_LCD_DIRECT, default 1): when the canonical format is RGB565, rotation is 0, and
 * the panel exposes 2–3 rotating framebuffers, the engine composites STRAIGHT into the panel
 * framebuffers — no canonical framebuffer and no present copy. The engine's multi-buffer damage
 * replay (er_set_display_buffer_count / er_display_present) repaints whatever each buffer missed
 * while the others were displayed. Present is then just a cache writeback of the dirty window plus
 * a buffer flip; with three framebuffers (num_fbs=3) there is always a swapped-out buffer ready to
 * draw into, so the flip never blocks. The canonical-fb path below remains for rotated configs,
 * ARGB8888 canonical builds, and single-framebuffer (copy mode) panels.
 *
 * Board specifics (RGB timings, pins, the CH422G expander for reset/backlight) live in the host that
 * creates the panel — this file only needs the panel handle.
 */

#include "er_scene.h" /* er_set_display_buffer_count / er_display_present (direct mode) */
#include "esp32_lcd_backend.h"
#include "native_renderer.h"

#include "esp_heap_caps.h"
#include "esp_lcd_panel_rgb.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"

#include <stdlib.h>
#include <string.h>

/** @brief 1 = canonical framebuffer is RGB565 (no convert pass); 0 = ARGB8888 (convert at present). */
#ifndef ER_LCD_FB_RGB565
#define ER_LCD_FB_RGB565 1
#endif

/**
 * @brief 1 = composite directly into the panel's rotating framebuffers when possible (RGB565
 *         canonical format, rotation 0, 2-3 panel framebuffers): no canonical framebuffer and no
 *         present copy — the engine's multi-buffer damage replay keeps every panel buffer current.
 *         0 = always use the canonical-framebuffer path.
 */
#ifndef ER_LCD_DIRECT
#define ER_LCD_DIRECT 1
#endif

/** @brief 1 = use the ESP32-S3 PIE 128-bit SIMD blend routines (8 px/iteration) for the hot
 *         source-over paths, verified against the scalar reference by a self-test at init.
 *         Requires the RGB565 canonical format; 0 = always use the scalar C loops. */
#ifndef ER_LCD_PIE
#define ER_LCD_PIE 1
#endif
#if ER_LCD_PIE && ER_LCD_FB_RGB565 && defined(CONFIG_IDF_TARGET_ESP32S3)
#define ER_LCD_PIE_ACTIVE 1
#include "pie_blend.h"
#else
#define ER_LCD_PIE_ACTIVE 0
#endif

/** @brief 1 = 2x2 ordered dithering in the SIMD blend paths (default): the RGB565 quantization
 *         error becomes a fine, spatially stable checkerboard instead of a frame-to-frame
 *         shimmer on animated fades. 0 = uniform round-to-nearest. PIE paths only. */
#ifndef ER_LCD_DITHER
#define ER_LCD_DITHER 1
#endif

/*----------------------------------------------------------------------------------------------------------------------
 - Pixel-format abstraction (canonical framebuffer)
 ---------------------------------------------------------------------------------------------------------------------*/

#if ER_LCD_FB_RGB565

typedef uint16_t fbpx_t; /**< Canonical framebuffer pixel: RGB565. */

/** @brief Packs an opaque ARGB8888 (0xFFRRGGBB) into an RGB565 framebuffer pixel. */
static inline fbpx_t fb_store(uint32_t argb)
{
    const uint16_t r = (uint16_t)(((argb >> 16) & 0xF8U) << 8);
    const uint16_t g = (uint16_t)(((argb >> 8) & 0xFCU) << 3);
    const uint16_t b = (uint16_t)((argb & 0xF8U) >> 3);
    return (uint16_t)(r | g | b);
}

/** @brief Unpacks an RGB565 framebuffer pixel to opaque ARGB8888, replicating high bits for accuracy. */
static inline uint32_t fb_load(fbpx_t p)
{
    const uint32_t r5 = (p >> 11) & 0x1FU;
    const uint32_t g6 = (p >> 5) & 0x3FU;
    const uint32_t b5 = p & 0x1FU;
    const uint32_t r = (r5 << 3) | (r5 >> 2);
    const uint32_t g = (g6 << 2) | (g6 >> 4);
    const uint32_t b = (b5 << 3) | (b5 >> 2);
    return 0xFF000000U | (r << 16) | (g << 8) | b;
}

/** @brief Emits n canonical pixels to an RGB565 output row — a straight copy (already 565). */
static inline void fb_to_565_row(uint16_t* dst, const fbpx_t* src, int n)
{
    memcpy(dst, src, (size_t)n * sizeof(uint16_t));
}

/** @brief Converts one canonical pixel to RGB565 (already 565 — identity). Used by rotated present. */
static inline uint16_t fb_to_565_px(fbpx_t p)
{
    return (uint16_t)p;
}

#define FB_CLEAR_PX ((fbpx_t)0x0000) /* opaque black */

#else /* ARGB8888 canonical */

typedef uint32_t fbpx_t; /**< Canonical framebuffer pixel: ARGB8888 (0xFFRRGGBB). */

static inline fbpx_t fb_store(uint32_t argb)
{
    return 0xFF000000U | (argb & 0x00FFFFFFU);
}

