TheMasterCoder007/embedded-react/backends/esp32-lcd/renderer_backend.c
static inline uint32_t fb_load(fbpx_t p)
{
    return p;
}

/** @brief Converts one ARGB8888 canonical pixel to RGB565. Used by rotated present. */
static inline uint16_t fb_to_565_px(fbpx_t p)
{
    const uint16_t r = (uint16_t)(((p >> 16) & 0xF8U) << 8);
    const uint16_t g = (uint16_t)(((p >> 8) & 0xFCU) << 3);
    const uint16_t b = (uint16_t)((p & 0xF8U) >> 3);
    return (uint16_t)(r | g | b);
}

/** @brief Converts n ARGB8888 canonical pixels to an RGB565 output row. */
static inline void fb_to_565_row(uint16_t* dst, const fbpx_t* src, int n)
{
    for (int i = 0; i < n; i++)
    {
        dst[i] = fb_to_565_px(src[i]);
    }
}

#define FB_CLEAR_PX ((fbpx_t)0xFF000000U) /* opaque black */

#endif /* ER_LCD_FB_RGB565 */

/*----------------------------------------------------------------------------------------------------------------------
 - State
 ---------------------------------------------------------------------------------------------------------------------*/

static const char* TAG = "er-lcd";

typedef struct
{
    esp_lcd_panel_handle_t panel;
    int w;                       /**< Logical (canonical fb) width — what the engine composites into. */
    int h;                       /**< Logical (canonical fb) height. */
    int pw;                      /**< Physical panel width (= w/h swapped for 90/270). */
    int ph;                      /**< Physical panel height. */
    int rot;                     /**< Clockwise display rotation: 0, 90, 180, or 270. */
    fbpx_t* fb;                  /**< Composite target: the canonical fb, or (direct mode) the back panel fb. */
    uint16_t* fbp[3];            /**< The panel's rotating RGB565 framebuffers; fbp[0] == NULL = copy mode. */
    int nfb;                     /**< Number of panel framebuffers in fbp (2 or 3; 0 in copy mode). */
    int back;                    /**< Index of the off-screen framebuffer to draw next. */
    uint16_t* line;              /**< RGB565 staging buffer (copy mode only, when double buffering is unavailable). */
    bool direct;                 /**< Direct mode: the engine composites straight into the panel framebuffers and the
                                      engine's multi-buffer damage replay keeps them all current — no canonical fb,
                                      no present copy. Requires RGB565 canonical format, rotation 0, and 2+ panel fbs. */
    SemaphoreHandle_t flip_done; /**< Given at each frame boundary: all earlier flips have taken effect. */
    int pending_flips;           /**< Flips requested since the last confirmed frame boundary. */
    /* Current dirty box: inclusive min corner, EXCLUSIVE max corner (matches ERRect). dx_end <= dx0
     * means "empty". The panel's own draw_bitmap window is exclusive too; the inclusive locals in
     * present() exist only because rot_box()/present_region() work in inclusive corners. */
    int dx0, dy0, dx_end, dy_end;
    /* Previous present's dirty box: unioned in so the back buffer (two presents stale) catches up. */
    int pdx0, pdy0, pdx_end, pdy_end;
    int present_count; /**< First two presents draw full-screen to initialise both framebuffers. */
    /* Persistent overlay: an RGB565 snapshot (see er_esp32_lcd_overlay_capture) re-composited on top
     * of every present, so a small always-on overlay stays consistent across both framebuffers and is
     * flushed as its own tight region — not unioned into (and ballooning) the app's dirty box. */
    uint16_t* ov_cache;
    int ov_cap; /**< Allocated capacity of ov_cache in pixels. */
    int ovx, ovy, ovw, ovh;
    bool ov_active;
    /* Saved dirty box around an overlay draw (er_esp32_lcd_overlay_begin): drawing the overlay into
     * the framebuffer to snapshot it must not leave the overlay's rect in the APP dirty box, or it
     * would balloon the app's per-frame flush (overlay corner unioned with far-away app damage). */
    int sdx0, sdy0, sdx_end, sdy_end;
} ERLcdBackend;

static ERLcdBackend s_be;

/*----------------------------------------------------------------------------------------------------------------------
 - Helpers
 ---------------------------------------------------------------------------------------------------------------------*/

/**
 * @brief Blocks until the current back framebuffer is safe to draw into (direct mode).
 *
 * A flip requested by draw_bitmap only takes effect at the next frame boundary; until then the
 * swapped-out buffer is still being scanned. The on_frame_buf_complete callback fires at every
 * frame boundary and confirms ALL flips requested before it, so with N framebuffers the back
 * buffer is unsafe only while (N-1) flips are still unconfirmed. With triple buffering this
 * effectively never blocks; with double buffering it waits up to one refresh — overlapped with
 * the frame's non-drawing work, since it runs lazily at the first write after a flip.
 */
/* Multi-core rendering: render workers on both cores call the blit callbacks concurrently, so
 * the tiny shared read-modify-writes (the flip gate, the dirty bounding box) sit inside this
 * spinlock. Uncontended cost is a few cycles per blit — noise next to the pixel work. */
static portMUX_TYPE s_blit_mux = portMUX_INITIALIZER_UNLOCKED;

static inline void flip_gate(void)
{
    if (!s_be.direct)
    {
        return;
    }
    taskENTER_CRITICAL(&s_blit_mux);
    const bool must_wait = (s_be.pending_flips >= s_be.nfb - 1);
    taskEXIT_CRITICAL(&s_blit_mux);
    if (!must_wait)
    {
        return;
    }
    if (s_be.flip_done)
    {
        if (xSemaphoreTake(s_be.flip_done, portMAX_DELAY) == pdTRUE)
        {
            taskENTER_CRITICAL(&s_blit_mux);
            s_be.pending_flips = 0; /* a frame boundary passed: earlier flips are live */
            taskEXIT_CRITICAL(&s_blit_mux);
        }
    }
}

/** @brief Clamps a rect to the framebuffer and returns false if fully off-screen. */
static bool clip_rect(int* x, int* y, int* w, int* h)
{
    if (*x < 0)
    {
        *w += *x;
        *x = 0;
    }
    if (*y < 0)
    {
        *h += *y;
        *y = 0;
    }
    if (*x + *w > s_be.w)
    {
        *w = s_be.w - *x;
    }
    if (*y + *h > s_be.h)
    {
        *h = s_be.h - *y;
    }
    return (*w > 0 && *h > 0);
}

