TheMasterCoder007/embedded-react/backends/esp32-lcd/renderer_backend.c
/** @brief Grows the dirty bounding box to include the given (already-clipped) rect.
 *
 * Serialized: concurrent render workers would otherwise lose min/max updates and under-flush. */
static void mark_dirty(int x, int y, int w, int h)
{
    taskENTER_CRITICAL(&s_blit_mux);
    if (x < s_be.dx0)
        s_be.dx0 = x;
    if (y < s_be.dy0)
        s_be.dy0 = y;
    if (x + w > s_be.dx_end)
        s_be.dx_end = x + w;
    if (y + h > s_be.dy_end)
        s_be.dy_end = y + h;
    taskEXIT_CRITICAL(&s_blit_mux);
}

/** @brief Maps a logical (canonical-fb) pixel to its physical (panel) position under the rotation. */
static inline void rot_point(int lx, int ly, int* px, int* py)
{
    switch (s_be.rot)
    {
        case 90:
            *px = s_be.pw - 1 - ly;
            *py = lx;
            break;
        case 180:
            *px = s_be.pw - 1 - lx;
            *py = s_be.ph - 1 - ly;
            break;
        case 270:
            *px = ly;
            *py = s_be.ph - 1 - lx;
            break;
        default:
            *px = lx;
            *py = ly;
            break;
    }
}

/** @brief Maps a logical box (inclusive) to its physical bounding box (still axis-aligned). */
static void rot_box(int x0, int y0, int x1, int y1, int* px0, int* py0, int* px1, int* py1)
{
    int ax, ay, bx, by;
    rot_point(x0, y0, &ax, &ay);
    rot_point(x1, y1, &bx, &by);
    *px0 = ax < bx ? ax : bx;
    *py0 = ay < by ? ay : by;
    *px1 = ax > bx ? ax : bx;
    *py1 = ay > by ? ay : by;
}

/**
 * @brief Writes the logical region [x0..x1]x[y0..y1] of the canonical fb into a physical 565 buffer.
 *
 * dst has row stride dst_stride pixels, and its element (0,0) is physical (dst_ox, dst_oy). At 0° this
 * is the fast per-row 565 copy; otherwise each pixel is placed at its rotated physical position.
 */
static void present_region(uint16_t* dst, int dst_stride, int dst_ox, int dst_oy, int x0, int y0, int x1, int y1)
{
    if (s_be.rot == 0)
    {
        const int rw = x1 - x0 + 1;
        for (int ly = y0; ly <= y1; ly++)
        {
            const fbpx_t* s = s_be.fb + (size_t)ly * s_be.w + x0;
            uint16_t* o = dst + (size_t)(ly - dst_oy) * dst_stride + (x0 - dst_ox);
            fb_to_565_row(o, s, rw);
        }
        return;
    }
    for (int ly = y0; ly <= y1; ly++)
    {
        const fbpx_t* s = s_be.fb + (size_t)ly * s_be.w;
        for (int lx = x0; lx <= x1; lx++)
        {
            int px, py;
            rot_point(lx, ly, &px, &py);
            dst[(size_t)(py - dst_oy) * dst_stride + (px - dst_ox)] = fb_to_565_px(s[lx]);
        }
    }
}

/**
 * @brief Composites one premultiplied ARGB8888 source pixel over an opaque dst pixel (8-bit precision).
 *
 * out_rgb = src_rgb + dst_rgb * (255 - src_a) / 255   (premultiplied "over"; dst alpha is implicitly 1)
 *
 * @param[in] dst  Existing pixel unpacked to opaque ARGB8888 (0xFFRRGGBB).
 * @param[in] sp   Premultiplied source pixel (0xAARRGGBB, RGB already scaled by alpha).
 *
 * @return The composited opaque pixel (0xFFRRGGBB), ready to pack via fb_store.
 */
/**
 * @brief Fast source-over of a premultiplied ARGB8888 pixel onto an opaque canonical pixel.
 *
 * Paired-channel arithmetic: R+B blend in one 32-bit multiply, G in another — 2 multiplies
 * per pixel instead of ~6, at the cost of ≤1 LSB darkening (inv = 255-sa with >>8), which is
 * below the RGB565 quantization step. This is the per-pixel core of the composited-strip →
 * framebuffer emit, the hottest loop on PSRAM-framebuffer boards.
 */
static inline fbpx_t over_premul_fast(fbpx_t dst, uint32_t sp)
{
    const uint32_t sa = sp >> 24;
    if (sa == 255U)
    {
        return fb_store(sp);
    }
    if (sa == 0U)
    {
        return dst;
    }
    const uint32_t inv = 255U - sa;
    const uint32_t d = fb_load(dst);
    const uint32_t orb = ((sp & 0x00FF00FFU) + (((d & 0x00FF00FFU) * inv >> 8) & 0x00FF00FFU)) & 0x00FF00FFU;
    const uint32_t og = ((sp & 0x0000FF00U) + (((d & 0x0000FF00U) * inv >> 8) & 0x0000FF00U)) & 0x0000FF00U;
    return fb_store(0xFF000000U | orb | og);
}

/** @brief Scales a premultiplied ARGB8888 pixel (all four channels) by alpha/255, paired. */
static inline uint32_t scale_premul_fast(uint32_t sp, uint32_t alpha)
{
    /* a1 in [0,256]: 255→256 keeps full-opacity lossless. */
    const uint32_t a1 = alpha + (alpha >> 7);
    const uint32_t ag = ((sp >> 8) & 0x00FF00FFU) * a1; /* A and G lanes */
    const uint32_t rb = (sp & 0x00FF00FFU) * a1;        /* R and B lanes */
    return ((ag & 0xFF00FF00U)) | ((rb >> 8) & 0x00FF00FFU);
}

static inline uint32_t over_premul(uint32_t dst, uint32_t sp)
{
    const uint32_t sa = sp >> 24;
    if (sa == 255U)
    {
        return 0xFF000000U | (sp & 0x00FFFFFFU);
    }
    if (sa == 0U)
    {
        return dst;
    }
    const uint32_t inv = 255U - sa;
    const uint32_t dr = (dst >> 16) & 0xFFU;
    const uint32_t dg = (dst >> 8) & 0xFFU;
    const uint32_t db = dst & 0xFFU;
    const uint32_t sr = (sp >> 16) & 0xFFU;
    const uint32_t sg = (sp >> 8) & 0xFFU;
    const uint32_t sb = sp & 0xFFU;
    const uint32_t r = sr + (dr * inv + 127U) / 255U;
    const uint32_t g = sg + (dg * inv + 127U) / 255U;
    const uint32_t b = sb + (db * inv + 127U) / 255U;
    return 0xFF000000U | (r << 16) | (g << 8) | b;
}

/** @brief Composites the cached RGB565 overlay (logical coords) onto the physical panel buffer. */
static void blit_overlay(uint16_t* dst)
{
    if (s_be.rot == 0)
    {
        for (int row = 0; row < s_be.ovh; row++)
        {
            const uint16_t* s = s_be.ov_cache + (size_t)row * s_be.ovw;
            uint16_t* o = dst + (size_t)(s_be.ovy + row) * s_be.pw + s_be.ovx;
            memcpy(o, s, (size_t)s_be.ovw * sizeof(uint16_t));
        }
        return;
    }
    for (int row = 0; row < s_be.ovh; row++)
    {
        const int ly = s_be.ovy + row;
        const uint16_t* s = s_be.ov_cache + (size_t)row * s_be.ovw;
        for (int col = 0; col < s_be.ovw; col++)
        {
            int px, py;
            rot_point(s_be.ovx + col, ly, &px, &py);
            dst[(size_t)py * s_be.pw + px] = s[col];
        }
    }
}

/*----------------------------------------------------------------------------------------------------------------------
 - Backend callbacks
 ---------------------------------------------------------------------------------------------------------------------*/

/* Row staging buffer (internal DRAM): the canonical framebuffer lives in PSRAM, where per-pixel
 * read-modify-write stalls ~90 cycles/px. Blends copy the destination row in with a burst memcpy,
 * blend against internal memory, and burst the result back — several times faster than in-place.
 * 16-byte aligned so the PIE SIMD routines can run on it directly. */
#define ER_ROW_STAGE_MAX 1024
/* One staging slot per CPU core: render workers are core-pinned, so indexing by the core id gives
 * every concurrent blit its own buffers with no locking (slot 0 doubles as the single-core slot). */
__attribute__((aligned(16))) static fbpx_t s_row_stage_pool[2][ER_ROW_STAGE_MAX];

/** @brief This core's row staging buffer. */
static inline fbpx_t* row_stage(void)
{
    return s_row_stage_pool[xPortGetCoreID()];
}
#if ER_LCD_PIE_ACTIVE
/* Aligned source staging for the SIMD path when a source row is not 16-byte aligned. */
__attribute__((aligned(16))) static uint32_t s_pie_src_pool[2][ER_ROW_STAGE_MAX];

