TheMasterCoder007/embedded-react/backends/esp32-lcd/renderer_backend.c
/** @brief This core's SIMD source staging buffer. */
static inline uint32_t* pie_src_stage(void)
{
    return s_pie_src_pool[xPortGetCoreID()];
}
static bool s_pie = false; /* PIE routines enabled (self-test passed at init) */
#endif

/** @brief Fills a rect with a straight-alpha ARGB8888 color, composited over the framebuffer. */
static void fill_cb(uint32_t argb, int x, int y, int w, int h, void* ctx)
{
    (void)ctx;
    flip_gate();
    if (!clip_rect(&x, &y, &w, &h))
    {
        return;
    }
    /* Premultiply the straight-alpha fill color, then composite like copy/blend. */
    const uint32_t a = argb >> 24;
    const uint32_t pr = (((argb >> 16) & 0xFFU) * a + 127U) / 255U;
    const uint32_t pg = (((argb >> 8) & 0xFFU) * a + 127U) / 255U;
    const uint32_t pb = ((argb & 0xFFU) * a + 127U) / 255U;
    const uint32_t sp = (a << 24) | (pr << 16) | (pg << 8) | pb;
    const fbpx_t opaque_px = fb_store(0xFF000000U | (argb & 0x00FFFFFFU));

    for (int row = 0; row < h; row++)
    {
        fbpx_t* d = s_be.fb + (size_t)(y + row) * s_be.w + x;
        if (a == 255U)
        {
            for (int col = 0; col < w; col++)
            {
                d[col] = opaque_px;
            }
        }
        else
        {
            /* Translucent fill: stage the row internally (see blend_cb). */
            fbpx_t* stage = (w <= ER_ROW_STAGE_MAX) ? row_stage() : d;
            if (stage != d)
                memcpy(stage, d, (size_t)w * sizeof(fbpx_t));
            int col0 = 0;
#if ER_LCD_PIE_ACTIVE
            if (a != 0U && s_pie && stage == row_stage() && w >= 8)
            {
                const int n8 = w / 8;
                er_pie_fill_row_565(stage, sp, n8);

                for (int col = n8 * 8; col < w; col++)
                {
                    stage[col] = er_pie_blend_px_565(stage[col], sp, 255U, -1, col);
                }
                col0 = w;
            }
#endif
            for (int col = col0; col < w; col++)
            {
                stage[col] = over_premul_fast(stage[col], sp);
            }
            if (stage != d)
                memcpy(d, stage, (size_t)w * sizeof(fbpx_t));
        }
    }
    mark_dirty(x, y, w, h);
}

/** @brief Copies a premultiplied ARGB8888 buffer into the framebuffer (premultiplied over). */
static void copy_cb(const void* src, int src_stride_bytes, int x, int y, int w, int h, void* ctx)
{
    (void)ctx;
    flip_gate();
    const int ox = x, oy = y;
    if (!clip_rect(&x, &y, &w, &h))
    {
        return;
    }
    const int skip_x = x - ox;
    const int skip_y = y - oy;
    for (int row = 0; row < h; row++)
    {
        const uint32_t* s = (const uint32_t*)((const uint8_t*)src + (size_t)(skip_y + row) * src_stride_bytes) + skip_x;
        fbpx_t* d = s_be.fb + (size_t)(y + row) * s_be.w + x;
        for (int col = 0; col < w; col++)
        {
            const uint32_t p = s[col];
            const uint32_t sa = p >> 24;
            if (sa == 255U)
            {
                d[col] = fb_store(p);
            }
            else if (sa != 0U)
            {
                d[col] = over_premul_fast(d[col], p);
            }
        }
    }
    mark_dirty(x, y, w, h);
}

/** @brief Copies a KNOWN-FULLY-OPAQUE source in its native format into the framebuffer (replace).
 *
 *  The engine only routes buffers its registration-time opacity scan proved opaque (RGB565 is
 *  opaque by construction), so there is no per-pixel alpha branch and no destination read. On the
 *  RGB565 canonical framebuffer a 565 source row is a straight burst memcpy — the whole point of
 *  the 16-bit bake: a full-screen background repaint is h row copies, not ~1M CPU conversions. */
static void copy_fmt_cb(const void* src, int src_stride_bytes, ERImageFormat fmt, int x, int y, int w, int h, void* ctx)
{
    (void)ctx;
    flip_gate();
    const int ox = x, oy = y;
    if (!clip_rect(&x, &y, &w, &h))
    {
        return;
    }
    const int skip_x = x - ox;
    const int skip_y = y - oy;
    if (fmt == ER_IMG_RGB565)
    {
        for (int row = 0; row < h; row++)
        {
            const uint16_t* s =
                (const uint16_t*)((const uint8_t*)src + (size_t)(skip_y + row) * src_stride_bytes) + skip_x;
            fbpx_t* d = s_be.fb + (size_t)(y + row) * s_be.w + x;
#if ER_LCD_FB_RGB565
            memcpy(d, s, (size_t)w * sizeof(fbpx_t));
#else
            for (int col = 0; col < w; col++)
            {
                /* Expand 565 → opaque ARGB canonical pixel (bit replication, matching the engine). */
                const uint32_t r5 = (s[col] >> 11) & 0x1FU;
                const uint32_t g6 = (s[col] >> 5) & 0x3FU;
                const uint32_t b5 = s[col] & 0x1FU;
                d[col] = 0xFF000000U | (((r5 << 3) | (r5 >> 2)) << 16) | (((g6 << 2) | (g6 >> 4)) << 8)
                         | ((b5 << 3) | (b5 >> 2));
            }
#endif
        }
    }
    else
    {
        for (int row = 0; row < h; row++)
        {
            const uint32_t* s =
                (const uint32_t*)((const uint8_t*)src + (size_t)(skip_y + row) * src_stride_bytes) + skip_x;
            fbpx_t* d = s_be.fb + (size_t)(y + row) * s_be.w + x;
            for (int col = 0; col < w; col++)
            {
                d[col] = fb_store(s[col]); /* opaque contract: no alpha inspection */
            }
        }
    }
    mark_dirty(x, y, w, h);
}

/** @brief Blends a premultiplied ARGB8888 buffer over the framebuffer at a global alpha. */
static void blend_cb(const void* src, int src_stride_bytes, uint8_t alpha, int x, int y, int w, int h, void* ctx)
{
    (void)ctx;
    flip_gate();
    if (alpha == 0U)
    {
        return;
    }
    const int ox = x, oy = y;
    if (!clip_rect(&x, &y, &w, &h))
    {
        return;
    }
    const int skip_x = x - ox;
    const int skip_y = y - oy;
    const uint32_t ga = alpha;
    for (int row = 0; row < h; row++)
    {
        const uint32_t* s = (const uint32_t*)((const uint8_t*)src + (size_t)(skip_y + row) * src_stride_bytes) + skip_x;
        fbpx_t* d = s_be.fb + (size_t)(y + row) * s_be.w + x;
        /* Stage the destination row in internal DRAM: one burst in, blend internally, one
         * burst out — instead of a ~90-cycle PSRAM read-modify-write per pixel. */
        fbpx_t* stage = (w <= ER_ROW_STAGE_MAX) ? row_stage() : d;
        if (stage != d)
            memcpy(stage, d, (size_t)w * sizeof(fbpx_t));
        int col0 = 0;
#if ER_LCD_PIE_ACTIVE
        /* SIMD path: 8 px per iteration on the aligned stage row, plus a matching scalar mop-up
         * for the tail. A misaligned source row is burst-copied to the aligned staging first. */
        if (s_pie && stage == row_stage() && w >= 8)
        {
            const uint32_t* s2 = s;
            if (((uintptr_t)s & 15U) != 0U)
            {
                memcpy(pie_src_stage(), s, (size_t)w * sizeof(uint32_t));
                s2 = pie_src_stage();
            }
            const int n8 = w / 8;
            /* Dither phase = (x + y) parity of the row's first pixel, so the checkerboard is
             * anchored to screen coordinates (spatially stable across frames and regions). */
            const int ph = ER_LCD_DITHER ? ((x + y + row) & 1) : 2;
            er_pie_blend_row_565(stage, s2, n8, (uint8_t)ga, ph);

            for (int col = n8 * 8; col < w; col++)
            {
                stage[col] = er_pie_blend_px_565(stage[col], s2[col], (uint8_t)ga, ph, col);
            }
            col0 = w;
        }
#endif
        if (ga == 255U)
        {
            /* Full-alpha path — the common case for composited strips, where most pixels are
             * fully opaque: no global-alpha scaling, opaque pixels skip the dst load. */
            for (int col = col0; col < w; col++)
            {
                const uint32_t p = s[col];
                const uint32_t sa = p >> 24;
                if (sa == 255U)
                {
                    stage[col] = fb_store(p);
                }
                else if (sa != 0U)
                {
                    stage[col] = over_premul_fast(stage[col], p);
                }
            }
        }
        else
        {
            for (int col = col0; col < w; col++)
            {
                /* Scale the premultiplied source by the global alpha (paired lanes), then over. */
                const uint32_t p = s[col];
                if (p == 0U)
                    continue;
                stage[col] = over_premul_fast(stage[col], scale_premul_fast(p, ga));
            }
        }
        if (stage != d)
            memcpy(d, stage, (size_t)w * sizeof(fbpx_t));
    }
    mark_dirty(x, y, w, h);
}

bool er_esp32_lcd_pie_enabled(void)
{
#if ER_LCD_PIE_ACTIVE
    return s_pie;
#else
    return false;
#endif
}

/** @brief Pushes the painted (dirty) region to the panel, re-compositing the overlay. */
void er_esp32_lcd_present(void)
{
    if (s_be.direct)
    {
        /* Direct mode: the engine composited straight into the back panel framebuffer, and its
         * multi-buffer damage replay already repainted everything this buffer missed while it was
         * off-screen — the dirty box therefore covers every pixel written since this buffer was
         * last flipped, and is exactly the cache-writeback window draw_bitmap needs. */
        bool have = (s_be.dx_end > s_be.dx0 && s_be.dy_end > s_be.dy0);
        int x0 = s_be.dx0, y0 = s_be.dy0, x1 = s_be.dx_end - 1, y1 = s_be.dy_end - 1;
        s_be.dx0 = s_be.w;
        s_be.dy0 = s_be.h;
        s_be.dx_end = 0;
        s_be.dy_end = 0;
        if (!have && !s_be.ov_active)
        {
            return; /* nothing changed: no flip, and the engine's buffer ring must not advance */
        }

        uint16_t* dst_fb = (uint16_t*)s_be.fb;
        /* Re-stamp the persistent overlay onto this buffer (its own tight region). */
        if (s_be.ov_active)
        {
            flip_gate(); /* the stamp writes the back buffer too */
            blit_overlay(dst_fb);
            if (!have)
            {
                x0 = s_be.ovx;
                y0 = s_be.ovy;
                x1 = s_be.ovx + s_be.ovw - 1;
                y1 = s_be.ovy + s_be.ovh - 1;
            }
            else
            {
                if (s_be.ovx < x0)
                    x0 = s_be.ovx;
                if (s_be.ovy < y0)
                    y0 = s_be.ovy;
                if (s_be.ovx + s_be.ovw - 1 > x1)
                    x1 = s_be.ovx + s_be.ovw - 1;
                if (s_be.ovy + s_be.ovh - 1 > y1)
                    y1 = s_be.ovy + s_be.ovh - 1;
            }
        }

        /* A frame boundary confirms every earlier flip: drain the grant (if any) BEFORE queuing
         * this flip so the pending count only tracks flips the panel hasn't absorbed yet. */
        if (s_be.flip_done && xSemaphoreTake(s_be.flip_done, 0) == pdTRUE)
        {
            s_be.pending_flips = 0;
        }

        /* Flip: draw_bitmap with a panel-owned buffer writes back the cache over the given window
         * and switches the scan-out buffer at the next frame boundary. The next frame's first
         * write into the new back buffer gates on flip_gate() — with three framebuffers that
         * effectively never blocks; with two it waits up to one refresh. */
        esp_lcd_panel_draw_bitmap(s_be.panel, x0, y0, x1 + 1, y1 + 1, dst_fb);
        s_be.pending_flips++;
        s_be.back = (s_be.back + 1) % s_be.nfb;
        s_be.fb = (fbpx_t*)s_be.fbp[s_be.back];
        er_display_present(); /* the next commit targets the new back buffer's damage debt */
        return;
    }

    const bool dbl = (s_be.fbp[0] != NULL);
    /* First two presents in double-buffer mode draw the whole frame so both framebuffers start valid. */
    const bool full = dbl && s_be.present_count < 2;

