TheMasterCoder007/embedded-react/backends/esp32-lcd/renderer_backend.c
    /* App dirty region to push. In double-buffer mode the back framebuffer is two presents stale, so
     * union the current and previous dirty boxes; in copy mode draw_bitmap writes the live framebuffer,
     * so only the current box is needed. */
    bool have = false;
    int x0 = 0, y0 = 0, x1 = -1, y1 = -1;
    if (full)
    {
        x0 = 0;
        y0 = 0;
        x1 = s_be.w - 1;
        y1 = s_be.h - 1;
        have = true;
    }
    else
    {
        if (s_be.dx_end > s_be.dx0 && s_be.dy_end > s_be.dy0)
        {
            x0 = s_be.dx0;
            y0 = s_be.dy0;
            x1 = s_be.dx_end - 1;
            y1 = s_be.dy_end - 1;
            have = true;
        }
        if (dbl && s_be.pdx_end > s_be.pdx0 && s_be.pdy_end > s_be.pdy0)
        {
            if (!have)
            {
                x0 = s_be.pdx0;
                y0 = s_be.pdy0;
                x1 = s_be.pdx_end - 1;
                y1 = s_be.pdy_end - 1;
                have = true;
            }
            else
            {
                if (s_be.pdx0 < x0)
                    x0 = s_be.pdx0;
                if (s_be.pdy0 < y0)
                    y0 = s_be.pdy0;
                if (s_be.pdx_end - 1 > x1)
                    x1 = s_be.pdx_end - 1;
                if (s_be.pdy_end - 1 > y1)
                    y1 = s_be.pdy_end - 1;
            }
        }
    }

    /* Roll current → previous, then reset the current box (we've captured everything we need above). */
    s_be.pdx0 = s_be.dx0;
    s_be.pdy0 = s_be.dy0;
    s_be.pdx_end = s_be.dx_end;
    s_be.pdy_end = s_be.dy_end;
    s_be.dx0 = s_be.w;
    s_be.dy0 = s_be.h;
    s_be.dx_end = 0;
    s_be.dy_end = 0;
    if (full)
    {
        s_be.present_count++;
    }
    /* Present when the app changed, OR there's an overlay to keep current on this frame's buffer. */
    if (!have && !s_be.ov_active)
    {
        return;
    }

    if (dbl)
    {
        uint16_t* dst_fb = s_be.fbp[s_be.back];
        /* App region: map the logical dirty region into the off-screen panel framebuffer with the
         * configured rotation (a plain 565→565 row copy at 0°). */
        if (have)
        {
            present_region(dst_fb, s_be.pw, 0, 0, x0, y0, x1, y1);
        }
        /* Overlay: re-composite the cached RGB565 panel on top (its own tight region — not unioned
         * into the app's dirty box, so a small corner overlay never enlarges the app flush). */
        if (s_be.ov_active)
        {
            blit_overlay(dst_fb);
        }
        /* draw_bitmap bounds are PHYSICAL panel coords: rotate the app + overlay logical boxes and
         * union them (the per-region writes above stay tight). */
        int bx0 = s_be.pw, by0 = s_be.ph, bx1 = -1, by1 = -1;
        if (have)
        {
            rot_box(x0, y0, x1, y1, &bx0, &by0, &bx1, &by1);
        }
        if (s_be.ov_active)
        {
            int ax, ay, axe, aye;
            rot_box(s_be.ovx, s_be.ovy, s_be.ovx + s_be.ovw - 1, s_be.ovy + s_be.ovh - 1, &ax, &ay, &axe, &aye);
            if (ax < bx0)
                bx0 = ax;
            if (ay < by0)
                by0 = ay;
            if (axe > bx1)
                bx1 = axe;
            if (aye > by1)
                by1 = aye;
        }
        esp_lcd_panel_draw_bitmap(s_be.panel, bx0, by0, bx1 + 1, by1 + 1, dst_fb);
        s_be.back ^= 1;
    }
    else
    {
        /* Copy mode: pack the (rotated) region row-tight into the staging buffer; draw_bitmap copies it
         * into the live framebuffer at the physical bounding box. */
        if (have)
        {
            int px0, py0, px1, py1;
            rot_box(x0, y0, x1, y1, &px0, &py0, &px1, &py1);
            present_region(s_be.line, px1 - px0 + 1, px0, py0, x0, y0, x1, y1);
            esp_lcd_panel_draw_bitmap(s_be.panel, px0, py0, px1 + 1, py1 + 1, s_be.line);
        }
        if (s_be.ov_active)
        {
            if (s_be.rot == 0)
            {
                esp_lcd_panel_draw_bitmap(
                    s_be.panel, s_be.ovx, s_be.ovy, s_be.ovx + s_be.ovw, s_be.ovy + s_be.ovh, s_be.ov_cache);
            }
            else
            {
                int px0, py0, px1, py1;
                rot_box(s_be.ovx, s_be.ovy, s_be.ovx + s_be.ovw - 1, s_be.ovy + s_be.ovh - 1, &px0, &py0, &px1, &py1);
                const int pbw = px1 - px0 + 1;
                for (int row = 0; row < s_be.ovh; row++)
                {
                    const int ly = s_be.ovy + row;
                    const uint16_t* s = s_be.ov_cache + (size_t)row * s_be.ovw;
                    for (int col = 0; col < s_be.ovw; col++)
                    {
                        int px, py;
                        rot_point(s_be.ovx + col, ly, &px, &py);
                        s_be.line[(size_t)(py - py0) * pbw + (px - px0)] = s[col];
                    }
                }
                esp_lcd_panel_draw_bitmap(s_be.panel, px0, py0, px1 + 1, py1 + 1, s_be.line);
            }
        }
    }
}

/** @brief Saves the current dirty box before an overlay is drawn into the framebuffer (see capture). */
void er_esp32_lcd_overlay_begin(void)
{
    s_be.sdx0 = s_be.dx0;
    s_be.sdy0 = s_be.dy0;
    s_be.sdx_end = s_be.dx_end;
    s_be.sdy_end = s_be.dy_end;
}

/** @brief Snapshots a framebuffer rect as the persistent overlay re-composited on every present. */
void er_esp32_lcd_overlay_capture(int x, int y, int w, int h)
{
    if (w <= 0 || h <= 0 || !clip_rect(&x, &y, &w, &h))
    {
        s_be.ov_active = false;
        /* Still roll back the dirty box: the overlay was drawn (dirtying its rect) but is composited
         * separately, so it must not enlarge the app's flush. */
        s_be.dx0 = s_be.sdx0;
        s_be.dy0 = s_be.sdy0;
        s_be.dx_end = s_be.sdx_end;
        s_be.dy_end = s_be.sdy_end;
        return;
    }
    const int need = w * h;
    if (need > s_be.ov_cap)
    {
        uint16_t* nc = (uint16_t*)heap_caps_malloc((size_t)need * sizeof(uint16_t), MALLOC_CAP_SPIRAM);
        if (!nc)
        {
            s_be.ov_active = false;
            return;
        }
        if (s_be.ov_cache)
        {
            heap_caps_free(s_be.ov_cache);
        }
        s_be.ov_cache = nc;
        s_be.ov_cap = need;
    }
    for (int row = 0; row < h; row++)
    {
        const fbpx_t* s = s_be.fb + (size_t)(y + row) * s_be.w + x;
        uint16_t* o = s_be.ov_cache + (size_t)row * w;
        fb_to_565_row(o, s, w);
    }
    s_be.ovx = x;
    s_be.ovy = y;
    s_be.ovw = w;
    s_be.ovh = h;
    s_be.ov_active = true;

    /* Roll the dirty box back to its pre-overlay state: the overlay's rect is composited every present
     * from the cache, so it must not stay in (and balloon) the app's per-frame dirty region. */
    s_be.dx0 = s_be.sdx0;
    s_be.dy0 = s_be.sdy0;
    s_be.dx_end = s_be.sdx_end;
    s_be.dy_end = s_be.sdy_end;
}

/*----------------------------------------------------------------------------------------------------------------------
 - Public
 ---------------------------------------------------------------------------------------------------------------------*/

