TheMasterCoder007/embedded-react/backends/esp32-lcd/renderer_backend.c
/** @brief ISR callback: the previously displayed framebuffer is now safe to draw into. */
static bool
frame_buf_complete_cb(esp_lcd_panel_handle_t panel, const esp_lcd_rgb_panel_event_data_t* edata, void* user_ctx)
{
    (void)panel;
    (void)edata;
    (void)user_ctx;
    BaseType_t hp_woken = pdFALSE;
    if (s_be.flip_done)
    {
        xSemaphoreGiveFromISR(s_be.flip_done, &hp_woken);
    }
    return hp_woken == pdTRUE;
}

bool er_esp32_lcd_backend_init(esp_lcd_panel_handle_t panel, int width, int height, int rotation)
{
    if (rotation != 0 && rotation != 90 && rotation != 180 && rotation != 270)
    {
        ESP_LOGE(TAG, "invalid rotation %d (must be 0/90/180/270)", rotation);
        return false;
    }
    s_be.panel = panel;
    s_be.w = width; /* logical (canonical fb) */
    s_be.h = height;
    s_be.rot = rotation;
    /* Physical panel size = logical with width/height swapped for 90/270. */
    s_be.pw = (rotation == 90 || rotation == 270) ? height : width;
    s_be.ph = (rotation == 90 || rotation == 270) ? width : height;
    s_be.dx0 = width;
    s_be.dy0 = height;
    s_be.dx_end = 0;
    s_be.dy_end = 0;
    s_be.pdx0 = width;
    s_be.pdy0 = height;
    s_be.pdx_end = 0;
    s_be.pdy_end = 0;
    s_be.present_count = 0;
    s_be.ov_active = false;

    /* Tear-free path: if the panel exposes rotating framebuffers (num_fbs 2 or 3), draw the
     * off-screen one and let draw_bitmap swap it in at vsync. Otherwise fall back to a staging
     * buffer that draw_bitmap copies into the live framebuffer (single-buffered; can tear). */
    void* fb0 = NULL;
    void* fb1 = NULL;
    void* fb2 = NULL;
    s_be.nfb = 0;
    if (esp_lcd_rgb_panel_get_frame_buffer(panel, 3, &fb0, &fb1, &fb2) == ESP_OK && fb0 && fb1 && fb2 && fb0 != fb1
        && fb0 != fb2 && fb1 != fb2)
    {
        s_be.nfb = 3;
    }
    else if (esp_lcd_rgb_panel_get_frame_buffer(panel, 2, &fb0, &fb1) == ESP_OK && fb0 && fb1 && fb0 != fb1)
    {
        s_be.nfb = 2;
        fb2 = NULL;
    }
    if (s_be.nfb > 0)
    {
        s_be.fbp[0] = (uint16_t*)fb0;
        s_be.fbp[1] = (uint16_t*)fb1;
        s_be.fbp[2] = (uint16_t*)fb2;
        s_be.back = 1; /* fb0 is displayed first; draw into fb1 */
        s_be.line = NULL;
    }
    else
    {
        s_be.fbp[0] = NULL;
        s_be.fbp[1] = NULL;
        s_be.fbp[2] = NULL;
        s_be.line = (uint16_t*)heap_caps_malloc((size_t)width * height * sizeof(uint16_t), MALLOC_CAP_SPIRAM);
        if (!s_be.line)
        {
            ESP_LOGE(TAG, "staging buffer alloc failed");
            return false;
        }
    }

    /* Direct mode: composite straight into the panel framebuffers. Needs the canonical format to BE
     * the panel format (RGB565), an identity rotation (blits land at panel coordinates), and both
     * panel framebuffers. The engine's multi-buffer damage replay repaints whatever each buffer
     * missed while the other was displayed, so no canonical framebuffer is required at all. */
    s_be.direct = (ER_LCD_DIRECT != 0) && (ER_LCD_FB_RGB565 != 0) && rotation == 0 && s_be.fbp[0] != NULL;

    if (s_be.direct)
    {
        /* The flip must be sequenced: after draw_bitmap queues a buffer switch, the swapped-out
         * buffer only becomes safe to draw into at the next frame boundary. Without that signal,
         * direct mode would tear — fall back to the canonical path instead. */
        s_be.flip_done = xSemaphoreCreateBinary();
        const esp_lcd_rgb_panel_event_callbacks_t cbs = {
            .on_frame_buf_complete = frame_buf_complete_cb,
        };
        if (!s_be.flip_done || esp_lcd_rgb_panel_register_event_callbacks(panel, &cbs, NULL) != ESP_OK)
        {
            ESP_LOGW(TAG, "frame_buf_complete callback unavailable; using the canonical-fb path");
            if (s_be.flip_done)
            {
                vSemaphoreDelete(s_be.flip_done);
                s_be.flip_done = NULL;
            }
            s_be.direct = false;
        }
    }

    if (s_be.direct)
    {
        /* All panel framebuffers start as the composite target; clear them to opaque black. */
        for (int i = 0; i < s_be.nfb; i++)
        {
            memset(s_be.fbp[i], 0, (size_t)width * height * sizeof(uint16_t));
        }
        /* Push fb0 full-screen once: writes the cleared pixels back through the cache and makes
         * fb0 the displayed buffer, so the panel shows black instead of allocation garbage. */
        esp_lcd_panel_draw_bitmap(panel, 0, 0, width, height, s_be.fbp[0]);
        s_be.fb = (fbpx_t*)s_be.fbp[s_be.back];
        s_be.pending_flips = 0;
    }
    else
    {
        s_be.fb = (fbpx_t*)heap_caps_malloc((size_t)width * height * sizeof(fbpx_t), MALLOC_CAP_SPIRAM);
        if (!s_be.fb)
        {
            ESP_LOGE(TAG,
                     "framebuffer alloc failed (need %d KB PSRAM)",
                     (int)((size_t)width * height * sizeof(fbpx_t) / 1024));
            return false;
        }
        /* Clear the framebuffer to opaque black so the first frame composites over a known background. */
        for (size_t i = 0; i < (size_t)width * height; i++)
        {
            s_be.fb[i] = FB_CLEAR_PX;
        }
    }

    static EmbeddedRenderBackend backend;
    backend.fill_rect = fill_cb;
    backend.copy_rect = copy_cb;
    backend.copy_rect_fmt = copy_fmt_cb;
    backend.blend_rect = blend_cb;
    backend.wait = NULL;
    backend.frame_ready = NULL; /* engine doesn't auto-present; the host calls er_esp32_lcd_present() */
    backend.ctx = NULL;
    embedded_renderer_set_backend(&backend);
    /* Direct mode rotates the panel framebuffers; tell the engine so each commit repaints the
     * target buffer's accumulated damage debt (see er_set_display_buffer_count in er_scene.h). */
    er_set_display_buffer_count(s_be.direct ? s_be.nfb : 1);

#if ER_LCD_PIE_ACTIVE
    /* Verify the SIMD blends against the scalar reference before trusting them. */
    s_pie = er_pie_blend_selftest();
    ESP_LOGI(TAG, "PIE SIMD blend: %s", s_pie ? "self-test passed, enabled" : "SELF-TEST FAILED, using C loops");
#endif

    ESP_LOGI(TAG,
             "LCD backend ready: logical %dx%d, panel %dx%d, rotation %d°, %s %s",
             width,
             height,
             s_be.pw,
             s_be.ph,
             rotation,
             s_be.direct ? "DIRECT to panel fbs," : "canonical fb",
             s_be.direct        ? "no canonical fb"
             : ER_LCD_FB_RGB565 ? "RGB565"
                                : "ARGB8888");
    return true;
}
